<a href="https://colab.research.google.com/github/Anuja-F/ineuron-Assignments/blob/master/datacleanngassgn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**It happens all the time: someone gives you data containing malformed strings,Python, lists and missing data. How do you tidy it up so you can get on with the analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:**

In [18]:
import pandas as pd
import numpy as np

In [19]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [20]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1.Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).**

In [21]:
for i in range(1,len(df)):
  if pd.isnull(df["FlightNumber"][i]):
    df["FlightNumber"][i]= df["FlightNumber"][i-1]+10
  
df["FlightNumber"].astype(int)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

**2.The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

In [23]:
temporarydf = df.copy()
temporarydf[["From","To"]] = temporarydf["From_To"].str.split("_",expand=True)
temporarydf

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN       10055.0  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis       10075.0  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

**3.Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)**

In [27]:
temporarydf["From_To"]

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [28]:
temporarydf["From_To"] = temporarydf["From_To"].str.capitalize()
temporarydf["From"] = temporarydf["From"].str.capitalize()
temporarydf["To"] = temporarydf["To"].str.capitalize()
temporarydf

            From_To  FlightNumber  ...      From         To
0      London_paris       10045.0  ...    London      Paris
1      Madrid_milan       10055.0  ...    Madrid      Milan
2  London_stockholm       10065.0  ...    London  Stockholm
3    Budapest_paris       10075.0  ...  Budapest      Paris
4   Brussels_london       10085.0  ...  Brussels     London

[5 rows x 6 columns]

**4.Delete the From_To column from df and attach the temporary DataFrame
from the previous questions**

In [29]:
df.drop("From_To",axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
0       10045.0      [23, 47]               KLM(!)
1       10055.0            []    <Air France> (12)
2       10065.0  [24, 43, 87]  (British Airways. )
3       10075.0          [13]       12. Air France
4       10085.0      [67, 32]          "Swiss Air"

In [32]:
df["From_To"] = temporarydf["From_To"]

df["From"] = temporarydf["From"]
df["To"] =temporarydf["To"]
df

                                  Airline  ...         To
0                            KLM(!)KLM(!)  ...      Paris
1      <Air France> (12)<Air France> (12)  ...      Milan
2  (British Airways. )(British Airways. )  ...  Stockholm
3            12. Air France12. Air France  ...      Paris
4                  "Swiss Air""Swiss Air"  ...     London

[5 rows x 6 columns]

**5.In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column,each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.**
**Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [45]:

temp = pd.DataFrame(df["RecentDelays"].values.tolist())
temp

      0     1     2     3     4     5
0  23.0  47.0  23.0  47.0   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN   NaN
2  24.0  43.0  87.0  24.0  43.0  87.0
3  13.0  13.0   NaN   NaN   NaN   NaN
4  67.0  32.0  67.0  32.0   NaN   NaN

In [50]:
length = temp.shape[1]
length

6

In [47]:
cols=[]
for i in range(length):
  cols.append("Delay_"+str(i))

temp = pd.DataFrame(df["RecentDelays"].values.tolist(),columns=cols)
temp

   Delay_0  Delay_1  Delay_2  Delay_3  Delay_4  Delay_5
0     23.0     47.0     23.0     47.0      NaN      NaN
1      NaN      NaN      NaN      NaN      NaN      NaN
2     24.0     43.0     87.0     24.0     43.0     87.0
3     13.0     13.0      NaN      NaN      NaN      NaN
4     67.0     32.0     67.0     32.0      NaN      NaN

In [48]:
df.drop("RecentDelays",axis=1,inplace=True)
df[cols] = temp[cols]
df

                                  Airline  FlightNumber  ... Delay_4 Delay_5
0                            KLM(!)KLM(!)       20090.0  ...     NaN     NaN
1      <Air France> (12)<Air France> (12)       20110.0  ...     NaN     NaN
2  (British Airways. )(British Airways. )       20130.0  ...    43.0    87.0
3            12. Air France12. Air France       20150.0  ...     NaN     NaN
4                  "Swiss Air""Swiss Air"       20170.0  ...     NaN     NaN

[5 rows x 11 columns]